# vsoWidgetPopupEnergy

## Description
Attach a widget for energy data to appear in the Object Info Palette.

```pascal
PROCEDURE vsoWidgetPopupEnergy(
				widgetID : LONGINT;
				dataType : INTEGER);
```

```python

def vs.vsoWidgetPopupEnergy(widgetID, dataType):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||
|dataType|INTEGER||

## Version
Availability: from Vectorworks 2016
## Category
* Object Events